[{"id":1,"title":"Read JSON File in PHP","content":"To read json file with php, you must first get the json data stored in the file, decode json and finally parse through the array or object. For that you'll need two php functions - one is file_get_contents() and the other is json_decode().","created_at":"Thu, 26 Sep 19 15:11:10 +0300"},{"id":2,"title":"Add to JSON File in PHP","content":"To add additional records to json file you have to simply append it to the end of file. Here let's see an example for adding new data. The following php snippet takes up a json file, decode it, add extra records and again encode to json and save it into a new file.","created_at":"Thu, 26 Sep 19 16:21:10 +0300"},{"id":3,"title":"Update JSON File PHP","content":"As for updating json file you can either modify single value or in bulk. Here's an example for modifying value for a specific json attribute.","created_at":"Thu, 26 Sep 19 17:31:10 +0300"},{"id":4,"title":"Delete JSON Data from File","content":"JSON deletion is little complex since it is easy to mess up doing the process. You must be clear what you need to delete first, a specific key pair from all rows or a complete row.\r\n\r\nFor example this php script will delete entire record from json containing key 'Code' as '2'.\r\n","created_at":"Thu, 26 Sep 19 17:32:10 +0300"},{"id":5,"title":"Modifying a JSON file with PHP","content":"This is a small and simple guide on how to modify a JSON file with PHP. For the purpose of this example, let’s say that our JSON file is called “example.json” and that it contains the following JSON data:\r\n\r\n{\"counter\":0}\r\n\r\nAs you can see, our file contains a small bit of JSON data. We have one variable called “counter”, which is set to zero.\r\n\r\nFor the purpose of this example, we will modify the counter variable whenever our page is loaded. Nothing fancy, just some basic incrementation. The first order of business is to load the JSON file and decode the data so that we can modify it. To do this, will will use the functions file_get_contents and json_decode.","created_at":"Sat, 28 Sep 19 17:15:14 +0300"}]